<img src="https://raw.githubusercontent.com/afo/data-x-plaksha/master/imgsource/dx_logo.png" align="left"></img><br><br><br><br>

## Plaksha SQL assignment

---

## Submission details:

Please submit this as a Jupyter Notebook and a PDF of your results (both should show output). Also push your solutions to Github.

For the submision create a local database with `sqlite3` or `sqlalchemy` in a Jupyter notebook and make the queries either with a cursor object (and then print the results) or by using pandas `pd.read_sql_query()`.

___

When completing this homework you can experiment with SQL commands by utilizing this great online editor:

https://www.w3schools.com/sql/trysql.asp?filename=trysql_select_all

There are already some tables in the online Database, namely:

`Categories, Employees, OrderDetails, Orders, Products, Shippers, and Suppliers.`

If you want you can drop them by running  `DROP TABLE [table-name];` (or just keep them).

___

## Exercises:

First create a table called students. It has the columns: 'student_id', 'name', 'major', 'gpa' and 'enrollment_date' We will use a new form of `CREATE TABLE` expression to produce this table.

Note that you can improve this and are welcome to do so -- e.g. by specifying for example a PRIMARY KEY and a FOREIGN KEY in Q2 :)

    CREATE TABLE students AS
        SELECT 1 AS student_id, "John" AS name, "Computer Science" AS major, 3.5 AS gpa, "01-01-2022" AS enrollment_date UNION
        SELECT 2, "Jane", "Physics", 3.8, "01-02-2022" UNION
        SELECT 3, "Bob", "Engineering", 3.0, "01-03-2022" UNION
        SELECT 4, "Samantha", "Physics", 3.9, "01-04-2022" UNION
        SELECT 5, "James", "Engineering", 3.7, "01-05-2022" UNION
        SELECT 6, "Emily", "Computer Science", 3.6, "01-06-2022" UNION
        SELECT 7, "Michael", "Computer Science", 3.2, "01-07-2022" UNION
        SELECT 8, "Jessica", "Engineering", 3.8, "01-08-2022" UNION
        SELECT 9, "Jacob", "Physics", 3.4, "01-09-2022" UNION
        SELECT 10, "Ashley", "Physics", 3.9, "01-10-2022";


## Q1 Simple SELECTS (on the students table)
1. SELECT all records in the table.
2. SELECT students whose major is "Computer Science".
3. SELECT all unique majors (use SELECT DISTINCT) and order them by name, descending order (i.e. Physics first).
4. SELECT all students that have an 'e' in their name and order them by gpa in ascending order.


## Q2 Joins

Create a new table called courses, which indicates the courses taken by the students. 

Create the table by running:
	
    CREATE TABLE courses AS
        SELECT 1 AS course_id, "Python programming" AS course_name, 1 AS student_id, "A" AS grade UNION
        SELECT 2, "Data Structures", 2, "B" UNION
        SELECT 3, "Database Systems", 3, "B" UNION
        SELECT 1, "Python programming", 4, "A" UNION
        SELECT 4, "Quantum Mechanics", 5, "C" UNION
        SELECT 1, "Python programming", 6, "F" UNION
        SELECT 2, "Data Structures", 7, "C" UNION
        SELECT 3, "Database Systems", 8, "A" UNION
        SELECT 4, "Quantum Mechanics", 9, "A" UNION
        SELECT 2, "Data Structures", 10, "F";

1. COUNT the number of unique courses.
2. JOIN the tables students and courses and COUNT the number of students with the major Computer Science taking the course Python programming.
3. JOIN the tables students and courses and select the students who have grades higher than "C", only show their name, major, gpa, course_name and grade.


## Q3 Aggregate functions, numerical logic and grouping

1. Find the average gpa of all students.
2. SELECT the student with the maximum gpa, display only their student_id, major and gpa
3. SELECT the student with the minimum gpa, display only their student_id, major and gpa
4. SELECT the students with a gpa greater than 3.6 in the majors of "Physics" and "Engineering", display only their student_id, major and gpa
5. Group the students by their major and retrieve the average grade of each major.
6. SELECT the top 2 students with the highest GPA in each major and order the results by major in ascending order, then by GPA in descending order

# Your solution

## 1.) Simple Selects

#### 1.) SELECT all records in the table

In [115]:
import sqlite3 as db
import pandas as pd
## creating a database
connection = db.connect('assignment_3.db')

## creating a cursor instance to interact with our database
cursor = connection.cursor()

In [29]:
## Creating database
command= """
CREATE TABLE students AS SELECT 1 AS student_id, "John" AS name, "Computer Science" AS major, 3.5 AS gpa, "01-01-2022" AS enrollment_date UNION
SELECT 2, "Jane", "Physics", 3.8, "01-02-2022" UNION
SELECT 3, "Bob", "Engineering", 3.0, "01-03-2022" UNION
SELECT 4, "Samantha", "Physics", 3.9, "01-04-2022" UNION
    SELECT 5, "James", "Engineering", 3.7, "01-05-2022" UNION
    SELECT 6, "Emily", "Computer Science", 3.6, "01-06-2022" UNION
    SELECT 7, "Michael", "Computer Science", 3.2, "01-07-2022" UNION
    SELECT 8, "Jessica", "Engineering", 3.8, "01-08-2022" UNION
    SELECT 9, "Jacob", "Physics", 3.4, "01-09-2022" UNION
    SELECT 10, "Ashley", "Physics", 3.9, "01-10-2022";
    """
cursor.execute(command)

In [45]:
command="""SELECT * FROM students"""
cursor.execute(command)

In [41]:
result=cursor.fetchall()

In [42]:
## checking if the intended data has been loaded##
for r in result:
    print(r)

(1, 'John', 'Computer Science', 3.5, '01-01-2022')
(2, 'Jane', 'Physics', 3.8, '01-02-2022')
(3, 'Bob', 'Engineering', 3.0, '01-03-2022')
(4, 'Samantha', 'Physics', 3.9, '01-04-2022')
(5, 'James', 'Engineering', 3.7, '01-05-2022')
(6, 'Emily', 'Computer Science', 3.6, '01-06-2022')
(7, 'Michael', 'Computer Science', 3.2, '01-07-2022')
(8, 'Jessica', 'Engineering', 3.8, '01-08-2022')
(9, 'Jacob', 'Physics', 3.4, '01-09-2022')
(10, 'Ashley', 'Physics', 3.9, '01-10-2022')

#### 2.) SELECT students whose major is "Computer Science".

In [117]:
## Selecting all students with CS major"
command="""SELECT * FROM students
        WHERE major=="Computer Science"
        """
cursor.execute(command)
pd.read_sql_query(command,con = connection)

   student_id     name             major  gpa enrollment_date
0           1     John  Computer Science  3.5      01-01-2022
1           6    Emily  Computer Science  3.6      01-06-2022
2           7  Michael  Computer Science  3.2      01-07-2022

In [47]:
## Checking the results of the query ##
result=cursor.fetchall()
for r in result:
    print(r)

(1, 'John', 'Computer Science', 3.5, '01-01-2022')
(6, 'Emily', 'Computer Science', 3.6, '01-06-2022')
(7, 'Michael', 'Computer Science', 3.2, '01-07-2022')

#### 3.) SELECT all unique majors (use SELECT DISTINCT) and order them by name, descending order (i.e. Physics first).

In [51]:
## Selecting Unique Majors, arranged in descending order ##
command="""SELECT DISTINCT major FROM students
        ORDER BY major DESC
        """
cursor.execute(command)
pd.read_sql_query(command,con = connection)

              major
0           Physics
1       Engineering
2  Computer Science

#### 4.) SELECT all students that have an 'e' in their name and order them by gpa in ascending order.

In [52]:
## Selecting all the students with character 'e', araanged by GPA ##

command="""SELECT * FROM students
        WHERE name LIKE '%e%'
        ORDER BY gpa
        """
cursor.execute(command)
pd.read_sql_query(command,con = connection)

   student_id     name             major  gpa enrollment_date
0           7  Michael  Computer Science  3.2      01-07-2022
1           6    Emily  Computer Science  3.6      01-06-2022
2           5    James       Engineering  3.7      01-05-2022
3           2     Jane           Physics  3.8      01-02-2022
4           8  Jessica       Engineering  3.8      01-08-2022
5          10   Ashley           Physics  3.9      01-10-2022

## 2.) Joins

#### 1.) COUNT the number of unique courses

In [54]:
## Creating courses table ##
command="""
CREATE TABLE courses AS
    SELECT 1 AS course_id, "Python programming" AS course_name, 1 AS student_id, "A" AS grade UNION
    SELECT 2, "Data Structures", 2, "B" UNION
    SELECT 3, "Database Systems", 3, "B" UNION
    SELECT 1, "Python programming", 4, "A" UNION
    SELECT 4, "Quantum Mechanics", 5, "C" UNION
    SELECT 1, "Python programming", 6, "F" UNION
    SELECT 2, "Data Structures", 7, "C" UNION
    SELECT 3, "Database Systems", 8, "A" UNION
    SELECT 4, "Quantum Mechanics", 9, "A" UNION
    SELECT 2, "Data Structures", 10, "F";
    """
cursor.execute(command)

In [56]:
command="""SELECT * from courses"""
cursor.execute(command)
pd.read_sql_query(command,con = connection)

   course_id         course_name  student_id grade
0          1  Python programming           1     A
1          1  Python programming           4     A
2          1  Python programming           6     F
3          2     Data Structures           2     B
4          2     Data Structures           7     C
5          2     Data Structures          10     F
6          3    Database Systems           3     B
7          3    Database Systems           8     A
8          4   Quantum Mechanics           5     C
9          4   Quantum Mechanics           9     A

In [58]:
## Counting number of unique courses ##
command="""
SELECT COUNT(DISTINCT course_id) FROM courses
"""
cursor.execute(command)
print("Number of unique courses in the table")
pd.read_sql_query(command,con = connection)

Number of unique courses in the table

   COUNT(DISTINCT course_id)
0                          4

#### 2.) JOIN the tables students and courses and COUNT the number of students with the major Computer Science taking the course Python programming.

In [67]:
## Joining students and courses table and getting number of CS students taking Python ##
command="""
SELECT COUNT(*) AS "Number of CS students taking Python"
FROM students
INNER JOIN courses ON students.student_id=courses.student_id
WHERE students.major='Computer Science' and courses.course_name='Python programming';
"""
cursor.execute(command)
pd.read_sql_query(command,con = connection)

   Number of CS students taking Python
0                                    2

#### 3.) JOIN the tables students and courses and select the students who have grades higher than "C", only show their name, major, gpa, course_name and grade.

Here, by higher grade we are taking grades which are considered better than C(at least in plaksha :))

In [72]:

command="""
SELECT students.name,students.major,students.gpa,courses.course_name,courses.grade
FROM students
INNER JOIN courses ON students.student_id=courses.student_id
WHERE courses.grade<'C'
ORDER BY courses.grade;
"""
cursor.execute(command)
pd.read_sql_query(command,con = connection)

       name             major  gpa         course_name grade
0      John  Computer Science  3.5  Python programming     A
1  Samantha           Physics  3.9  Python programming     A
2   Jessica       Engineering  3.8    Database Systems     A
3     Jacob           Physics  3.4   Quantum Mechanics     A
4      Jane           Physics  3.8     Data Structures     B
5       Bob       Engineering  3.0    Database Systems     B

## 3.) Aggregate functions, numerical logic and grouping

#### 1.) Find the average gpa of all students.

In [75]:
command="""
SELECT AVG(gpa) from students"""
cursor.execute(command)
pd.read_sql_query(command,con = connection)

   AVG(gpa)
0      3.58

#### 2.) SELECT the student with the maximum gpa, display only their student_id, major and gpa

In [77]:
command="""
SELECT student_id,major,gpa from students
ORDER BY gpa DESC
LIMIT 1
"""
cursor.execute(command)
pd.read_sql_query(command,con = connection)

   student_id    major  gpa
0           4  Physics  3.9

#### 3.) SELECT the student with the minimum gpa, display only their student_id, major and gpa

In [79]:
command="""
SELECT student_id,major,gpa from students
ORDER BY gpa ASC
LIMIT 1
"""
cursor.execute(command)
pd.read_sql_query(command,con = connection)

   student_id        major  gpa
0           3  Engineering  3.0

#### 4.) SELECT the students with a gpa greater than 3.6 in the majors of "Physics" and "Engineering", display only their student_id, major and gpa

In [86]:
command="""
SELECT student_id,major,gpa from students
WHERE major in ('Physics','Engineering') AND gpa >3.6
ORDER BY gpa DESC
"""
cursor.execute(command)
pd.read_sql_query(command,con = connection)

   student_id        major  gpa
0           4      Physics  3.9
1          10      Physics  3.9
2           2      Physics  3.8
3           8  Engineering  3.8
4           5  Engineering  3.7

#### 5.) Group the students by their major and retrieve the average grade of each major.

In [89]:
command="""
SELECT major,AVG(gpa) AS "Average GPA" from students
GROUP BY major
"""
cursor.execute(command)
pd.read_sql_query(command,con = connection)

              major  Average GPA
0  Computer Science     3.433333
1       Engineering     3.500000
2           Physics     3.750000

#### 6.) SELECT the top 2 students with the highest GPA in each major and order the results by major in ascending order, then by GPA in descending order

In [113]:
command="""
with temp as
(SELECT name,major,gpa, rank() OVER(PARTITION BY major
       ORDER BY gpa DESC) AS "Rank"
From students)
SELECT * from temp
WHERE Rank<3
ORDER BY major;
"""

cursor.execute(command)
pd.read_sql_query(command,con = connection)

       name             major  gpa  Rank
0     Emily  Computer Science  3.6     1
1      John  Computer Science  3.5     2
2   Jessica       Engineering  3.8     1
3     James       Engineering  3.7     2
4  Samantha           Physics  3.9     1
5    Ashley           Physics  3.9     1

In [114]:
connection.commit()